[
    {
      "Adress": 0,
      "Type": 1,
      "Blurb": "The cave entrance looms before you. Way back this used to be a sprawling mine but now, over 40 years later it has just become a mess of abandoned shafts and rooms filled with all sorts of leftovers from back in the day. This is going to be a long adventure.\nAre you ready?",
      "Subject": "Assets/Subjects/Cave_Entrance.png",
      "Background": "Assets/Backgrounds/Dirt_Fullscreen.png",
      "Choices": [
        "Go inside the mine"
      ],
      "Repercussions": [
        "You muster up all your courage and run into the mine"
      ],
      "Pointers": [
        1
      ]
    },

    {
      "Adress": 1,
      "Type": 1,
      "Blurb": "In your misadventures, you find a banana on the floor. Right as you were about to pass it, its eyes open and it yells at you. Stunned, you are left looking at the banana.",
      "Subject": "Assets/Subjects/BananaPeel.png",
      "Background": "Assets/Backgrounds/Dirt_Fullscreen.png",
      "Choices": [
        "Eat the banana",
        "Ignore the banana",
        "Talk to the banana"
      ],
      "Repercussions": [
        "The banana was delicious, you feel replenished and ready to continue your journey, so you do",
        "You decided ignoring the banana was the best course of action. You were wrong, while ignoring the banana, you slipped and cracked your skull",
        "You tried talking to the banana. It was an interesting conversation by which you were heavily moved. Filled with newfound hope, you continue your journey"
      ],
      "Pointers": [
        1,
        999,
        4
      ]
    },

    {
      "Adress": 4,
      "Type": 1,
      "Blurb": "You see only darkness ahead of you, this is not good. Conveniently, there is a torch right beside you with a \"take me\" sign underneath it.\nWould you like to take the torch?",
      "Subject": "Assets/Subjects/Torch.png",
      "Background": "Assets/Backgrounds/Dirt_Fullscreen.png",
      "Choices": [
        "Take the torch",
        "Torches are overrated"
      ],
      "Repercussions": [
        "You nibbed the torch and continued going ahead",
        "How dare you, torches are perfectly well rated... well anyway, you didn't see anything, so you tripped and fell and died, how unfortunate."
      ],
      "Pointers": [
        5,
        999
      ]
    },

    {
      "Adress": 5,
      "Type": 1,
      "Blurb": "You seem to have found yourself a spider den. The webs are quite icky and you feel as if you can't continue if you don't do something",
      "Subject": "Assets/Subjects/Web.png",
      "Background": "Assets/Backgrounds/Depths.png",
      "Choices": [
        "Burn the spider webs"
      ],
      "Repercussions": [
        "Using your trusty newfound torch you decided to burn the webs. None shall stand in your wa-\nYou suddenly hear a voice in the distance"
      ],
      "Pointers": [
        8
      ]
    },

    {
      "Adress": 8,
      "Type": 1,
      "Blurb": "A giant spider stands before you, talking to you.. you surely are going insane now. \"Please, don't burn it, I can help you, I know the way out. Please don't, I have a family, sir\". The spider's voice becomes weak as it weeps.",
      "Subject": "Assets/Subjects/Spider.png",
      "Background": "Assets/Backgrounds/Depths.png",
      "Choices": [
        "Burn the spider webs",
        "Agree to get the spider's help"
      ],
      "Repercussions": [
        "You burned the spider den, watching the spider's eyes shrink in the flames. In the distance you can hear the wails of children. You feel your sins crawling on your back",
        "\"You shan't regret this sir, I promise, I promise\". The spider grabbed your hand and dragged you through its den, you couldn't see what was happening but for a dim light, growing bigger and bigger"
      ],
      "Pointers": [
        9,
        888
      ]
    },

    {
      "Adress": 9,
      "Type": 1,
      "Blurb": "You feel bad about what you have done, your stomach turns when you look back at your actions",
      "Subject": "",
      "Background": "Assets/Backgrounds/Depths.png",
      "Choices": [
        "Thrudge on",
        "What have I done"
      ],
      "Repercussions": [
        "...",
        "Maybe there's hope for you still"
      ],
      "Pointers": [
        11,
        42
      ]
    },

    {
      "Adress": 11,
      "Type": 1,
      "Blurb": "Are you sure you don't feel bad?",
      "Subject": "",
      "Background": "Assets/Backgrounds/Depths.png",
      "Choices": [
        "Thrudge on",
        "Maybe I do"
      ],
      "Repercussions": [
        "...",
        "Maybe there's hope for you still"
      ],
      "Pointers": [
        998,
        42
      ]
    },

    {
      "Adress": 42,
      "Type": 1,
      "Blurb": "You see a small light at the end of a tunnel you decided to walk in in your moral distress",
      "Subject": "",
      "Background": "Assets/Backgrounds/Light.png",
      "Choices": [
        "Follow the light"
      ],
      "Repercussions": [
        "Don't you know it's bad to follow little lights at the ends of tunnels?"
      ],
      "Pointers": [
        888
      ]
    },

    {
      "Adress": 998,
      "Type": 1,
      "Blurb": "You're a monster",
      "Subject": "",
      "Background": "Assets/Backgrounds/Depths.png",
      "Choices": [
        "Thrudge on"
      ],
      "Repercussions": [
        "..."
      ],
      "Pointers": [
        999
      ]
    },


    {
      "Adress": 888,
      "Type": 1,
      "Blurb": "I do not know how you managed to do it, but you did it, congratulations\nYou have won the game",
      "Subject": "Assets/Subjects/winstate.png",
      "Background": "Assets/Backgrounds/Outside.png",
      "Choices": [
        "Awesome"
      ],
      "Repercussions": [
        "Awesome indeed"
      ],
      "Pointers": [
        888
      ]
    },
    {
      "Adress": 999,
      "Type": 1,
      "Blurb": "You have died. Your face was forgotten from the surface and whatever was left of you ended up in the worst depths of the mine. What a horrible fate has befallen you",
      "Subject": "Assets/Subjects/death.png",
      "Background": "Assets/Backgrounds/Depths.png",
      "Choices": [
        "Bummer"
      ],
      "Repercussions": [
        "What a horrible fate has befallen you"
      ],
      "Pointers": [
        999
      ]
    }


]
